---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Units
source: html/de96b3ae-d662-2f9a-2724-955cbce03719.htm
---
# Units Members

Creates a new Units object with default settings for Metric or Imperial units.